
. sqreg ten_y ttrend i.sexo1#c.ttrend i.sexo1#c.urate i.act1 i.covid##i.sexo1#i.act1 i.age ///
>                if ((mother_10==1&wife==1)|(father_10==1&husband==1))&employed&age3040==1, q(.25 .5 .75)     
>                             
(fitting base model)

Bootstrap replications (20)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
.....convergence not achieved
x..convergence not achieved
x....--Break--
r(1);

end of do-file

--Break--
r(1);

. do "C:\Users\LAFUEN~1\AppData\Local\Temp\STD33ec_000000.tmp"

. use "formatting/rawfiles/EPA_stocks20_parents.dta", clear

. 
end of do-file

. do "C:\Users\LAFUEN~1\AppData\Local\Temp\STD33ec_000000.tmp"

. gen age3040 = 0

. replace age3040 = 1 if age>=30&age<40
(1,444,285 real changes made)

. 
end of do-file

. tab ciclo ten_y if husband==1&father_10==1 [fweight=facexp]
too many values
r(134);

. tab ciclo if husband==1&father_10==1 [fweight=facexp], sum(ten_y )

            |                Summary of ten_y
      ciclo |        Mean   Std. dev.       Freq.         Obs
------------+------------------------------------------------
        130 |   9.8438732   8.2490792   329209062   329209062
        131 |   9.7617822   8.3158594   334392353   334392353
        132 |    9.682743   8.2519562   336846582   336846582
        133 |   9.6862999   8.2633579   342687836   342687836
        134 |   9.8369692   8.3876562   344563526   344563526
        135 |   9.7328362   8.4071565   346416498   346416498
        136 |   9.7470759   8.3404945   346346042   346346042
        137 |   9.6942328   8.3884931   346528990   346528990
        138 |    9.709147   8.3652693   348231135   348231135
        139 |   9.5347329   8.2533414   353763555   353763555
        140 |   9.4651563   8.1596572   355884720   355884720
        141 |    9.459449   8.1817334   354379214   354379214
        142 |   9.5080212    8.143206   354200728   354200728
        143 |   9.5319945   8.1429022   354316947   354316947
        144 |   9.6122307   8.2235333   352482660   352482660
        145 |   9.6230756   8.2787617   346643521   346643521
        146 |   9.9526666   8.3069199   332704830   332704830
        147 |   9.9552725   8.2509724   332177089   332177089
        148 |   9.9975527   8.2254556   330054658   330054658
        149 |   10.117761    8.205693   329199564   329199564
        150 |   10.346145   8.2398423   327563754   327563754
        151 |   10.410218   8.2699067   333975561   333975561
        152 |   10.440411   8.2661924   335261979   335261979
        153 |   10.581692   8.2925635   334669435   334669435
        154 |   10.661222   8.3495975   331853525   331853525
        155 |   10.473809   8.2753829   331532162   331532162
        156 |   10.425284   8.3183574   331347981   331347981
        157 |   10.426353   8.2628179   327536277   327536277
        158 |   10.474191   8.2405371   323043660   323043660
        159 |   10.469787   8.1789491   316938916   316938916
        160 |   10.605752   8.1167345   317257093   317257093
        161 |   10.777427   8.0728353   313292307   313292307
        162 |   10.938711   8.0578188   310408058   310408058
        163 |   10.665313   8.0686809   310826160   310826160
        164 |   10.618125   8.0654812   309004680   309004680
        165 |   10.414562   8.1322631   313566264   313566264
        166 |   10.431665   8.2013904   309170229   309170229
        167 |   10.276236     8.22597   313222534   313222534
        168 |   10.294049   8.2097739   316385905   316385905
        169 |    10.33044   8.2120964   322211034   322211034
        170 |   10.450693   8.2450089   321070004   321070004
        171 |   10.361796   8.2515011   327265982   327265982
        172 |    10.37458    8.227192   327917751   327917751
        173 |   10.433437   8.1503148   328524904   328524904
        174 |   10.484581   8.1842999   328938201   328938201
        175 |   10.408166   8.1730599   330212788   330212788
        176 |    10.33126   8.1520363   334561578   334561578
        177 |   10.370487   8.1126891   332194551   332194551
        178 |   10.522823   8.2230002   328038434   328038434
        179 |    10.40837    8.313182   331471357   331471357
        180 |   10.411481   8.3046253   331219935   331219935
        181 |   10.380572   8.2580236   334128774   334128774
        182 |   10.517903   8.3733361   334075790   334075790
        183 |   10.400647   8.3166961   334425779   334425779
        184 |   10.366851   8.3148831   334105800   334105800
        185 |   10.223829    8.285319   334761208   334761208
        186 |   10.358841   8.2970427   334070811   334070811
        187 |   10.158699   8.2652172   334007395   334007395
        188 |   10.197698   8.2609413   330702039   330702039
        189 |   10.167325   8.2318818   328091517   328091517
        190 |   10.373108   8.2494943   321325191   321325191
        191 |   10.729491   8.2058902   307202723   307202723
        192 |   10.607201   8.2162047   313120790   313120790
        193 |   10.593153   8.2285805   314171451   314171451
        194 |   11.125158   8.4087438   311355925   311355925
        195 |   10.773689   8.3701769   315299780   315299780
        196 |   10.774995   8.3883698   313830420   313830420
        197 |   10.625859   8.3084958   315959841   315959841
        198 |   10.949916   8.4304016   309074419   309074419
        199 |   10.745495   8.4144478   310015331   310015331
        200 |   10.723194   8.3866373   303874526   303874526
        201 |   10.654627   8.4542767   301562528   301562528
------------+------------------------------------------------
      Total |   10.271073   8.2660196   2.366e+10 -2147483648

. tab ciclo if husband==1&father_10==1&state=="P" [fweight=facexp], sum(ten_y )

            |                Summary of ten_y
      ciclo |        Mean   Std. dev.       Freq.         Obs
------------+------------------------------------------------
        130 |   11.458749   8.1196323   198310141   198310141
        131 |   11.676809   8.1771421   200132371   200132371
        132 |   11.584635   8.1482418   201568445   201568445
        133 |   11.666216   8.0956709   202319578   202319578
        134 |   11.905881   8.1885545   202231876   202231876
        135 |   11.777362   8.2203931   201040820   201040820
        136 |   11.715695   8.1707641   201532852   201532852
        137 |   11.648024    8.314115   200833449   200833449
        138 |   11.527034   8.2590318   206840875   206840875
        139 |   11.284576   8.1946662   210223829   210223829
        140 |   11.169182   8.1413821   211824017   211824017
        141 |   11.145833   8.1008659   213342299   213342299
        142 |   11.100329   8.0703395   214697774   214697774
        143 |   11.229061   8.0771308   216203121   216203121
        144 |   11.230655    8.131744   216236108   216236108
        145 |   11.158292   8.1584659   213398696   213398696
        146 |   11.457756   8.1678854   212487454   212487454
        147 |   11.510819   8.0606088   209811796   209811796
        148 |   11.570736   8.0194393   208130093   208130093
        149 |   11.650653   7.9953454   209067927   209067927
        150 |   11.833354    8.039334   208441674   208441674
        151 |   11.853309   8.0297428   212890630   212890630
        152 |   11.859205   7.9765111   213793590   213793590
        153 |   12.008738   8.0061355   215040200   215040200
        154 |   12.062731   8.0261804   212844455   212844455
        155 |   11.892562   7.9645055   213511769   213511769
        156 |   11.861302   7.9857647   212866536   212866536
        157 |   11.884101    7.904811   208306532   208306532
        158 |   11.841128   7.8869737   209505222   209505222
        159 |   11.851683   7.7959528   204825964   204825964
        160 |   11.956741   7.7380345   205211432   205211432
        161 |   12.158345   7.6900277   202154304   202154304
        162 |   12.239237   7.6152312   201466328   201466328
        163 |   12.179534   7.6876823   199920687   199920687
        164 |   12.176582   7.6523207   197873574   197873574
        165 |   12.080232   7.7014822   199279736   199279736
        166 |   12.105059   7.8200564   197025988   197025988
        167 |   11.989464   7.8066962   199244613   199244613
        168 |   11.977165   7.7675788   200513960   200513960
        169 |   11.948119   7.7658327   204019456   204019456
        170 |   12.020598   7.8513531   205756517   205756517
        171 |   12.085359   7.8430811   206743061   206743061
        172 |   12.051972   7.8045662   206306813   206306813
        173 |    12.00342   7.7083049   208639786   208639786
        174 |   11.940497   7.8031289   212326932   212326932
        175 |   11.873107    7.774143   213179477   213179477
        176 |    11.82971   7.7113776   215200677   215200677
        177 |   11.849693   7.6959662   215173687   215173687
        178 |   11.926142   7.8102225   213423665   213423665
        179 |   11.969558   7.9047644   213225067   213225067
        180 |   11.980671   7.8946257   212830408   212830408
        181 |   11.838467   7.8482472   215823804   215823804
        182 |   11.923731   7.9956263   217832451   217832451
        183 |   11.812982   7.9642252   218781072   218781072
        184 |   11.776373    7.939955   218251014   218251014
        185 |   11.687745   7.9503861   215369635   215369635
        186 |   11.764416   7.9643853   216916131   216916131
        187 |   11.534444   8.0087997   218115782   218115782
        188 |   11.601438   8.0338356   216575495   216575495
        189 |   11.535993   7.9460082   216122950   216122950
        190 |   11.662263   7.9596744   212845732   212845732
        191 |    11.88664   7.9107401   208032365   208032365
        192 |   11.800664   7.8827953   210833061   210833061
        193 |   11.786804   7.8777416   210351204   210351204
        194 |   12.289384   8.0794342   211233693   211233693
        195 |   11.957259   8.0761178   213093036   213093036
        196 |   11.937093   8.0976551   212758847   212758847
        197 |   11.740415   7.9638959   212878659   212878659
        198 |   12.090354   8.1086575   209024654   209024654
        199 |   11.590974   8.1412366   213206614   213206614
        200 |   11.458563   8.1848034   216754763   216754763
        201 |   11.297335   8.3282567   218181069   218181069
------------+------------------------------------------------
      Total |    11.77115   7.9761742   1.509e+10 -2147483648

. tab ciclo if husband==1&father_10==1&age3040==1 [fweight=facexp], sum(ten_y )

            |                Summary of ten_y
      ciclo |        Mean   Std. dev.       Freq.         Obs
------------+------------------------------------------------
        130 |   7.3250284   5.9051412   147232304   147232304
        131 |   7.0434038   5.7586887   146711062   146711062
        132 |   6.9413443   5.7315531   150764173   150764173
        133 |   6.8775707   5.7256837   152557453   152557453
        134 |   6.8934042   5.8131254   151377436   151377436
        135 |   6.8383524   5.8351597   150106225   150106225
        136 |   6.9276148   5.8656007   150478158   150478158
        137 |   6.8643651   5.8028969   150100141   150100141
        138 |   6.8090617   5.8211646   150679590   150679590
        139 |   6.7268785   5.6942494   152266485   152266485
        140 |   6.6819103   5.6129836   154128275   154128275
        141 |   6.5629372   5.5740062   155283080   155283080
        142 |   6.6471032   5.6013711   154585866   154585866
        143 |   6.6382822    5.592962   151139844   151139844
        144 |    6.622793   5.5934179   151187547   151187547
        145 |   6.5169904   5.5031477   149074478   149074478
        146 |   6.7589315   5.5425971   142138650   142138650
        147 |   6.8938705   5.5907568   140179702   140179702
        148 |   6.8614409   5.5092247   137426758   137426758
        149 |     7.05253   5.5449051   137883878   137883878
        150 |   7.1296285   5.5505173   136246452   136246452
        151 |   7.1767309   5.5795246   137556713   137556713
        152 |   7.2303548   5.5692941   136472567   136472567
        153 |    7.383484   5.5962859   136485110   136485110
        154 |   7.3662566   5.6485693   133723525   133723525
        155 |   7.2595805   5.5488618   133342936   133342936
        156 |    7.172902    5.484139   132744409   132744409
        157 |   7.1500057   5.4136773   131145623   131145623
        158 |   7.3092706   5.4127428   129657454   129657454
        159 |   7.2184396   5.2957867   126202520   126202520
        160 |   7.5090063   5.3090061   125198416   125198416
        161 |   7.6288167   5.2674976   122510940   122510940
        162 |   7.6899656    5.336014   121735379   121735379
        163 |   7.4559827   5.4192851   122274677   122274677
        164 |   7.4852946   5.4890966   119885571   119885571
        165 |   7.1531324   5.5018505   122783808   122783808
        166 |   7.1652266   5.5448743   118125856   118125856
        167 |   7.0929624   5.5206104   119234056   119234056
        168 |   7.1593177   5.5249704   119995672   119995672
        169 |   7.0976789   5.5202236   121315808   121315808
        170 |    7.153013   5.4801188   119662023   119662023
        171 |   7.1262955   5.5386958   121906776   121906776
        172 |    7.062053   5.4787786   123653488   123653488
        173 |   7.3314196   5.5580544   121488704   121488704
        174 |   7.3809753   5.6031326   118486484   118486484
        175 |   7.2597659    5.577067   118286366   118286366
        176 |   7.2480024    5.536171   117766136   117766136
        177 |   7.2164024   5.4890507   114326655   114326655
        178 |   7.2803174   5.5528801   112798492   112798492
        179 |   7.1741658   5.5407687   110177617   110177617
        180 |   7.1076481   5.4941609   109862808   109862808
        181 |   7.1926556   5.4749573   109698835   109698835
        182 |   7.3289114   5.6478714   109442524   109442524
        183 |   7.2426563   5.6927546   108164167   108164167
        184 |   7.2280411   5.7176822   104720732   104720732
        185 |   7.1205416    5.743779   103145699   103145699
        186 |   7.2039984   5.7337187   101865684   101865684
        187 |   6.9339633   5.6710651   104363736   104363736
        188 |   6.8650911   5.6598764   101210177   101210177
        189 |   6.6983099   5.5677018    98884614    98884614
        190 |   6.9674991   5.6249295    95660743    95660743
        191 |   7.2766799   5.5286434    88790293    88790293
        192 |   7.1035114   5.5660388    89995226    89995226
        193 |   7.1227288   5.6323732    90003161    90003161
        194 |   7.3962673   5.7926486    84602835    84602835
        195 |   7.4061798   5.7823397    84768124    84768124
        196 |   7.2440785   5.8278442    82977767    82977767
        197 |   7.2949332   5.8537515    81431142    81431142
        198 |   7.3017461   5.8258256    78470375    78470375
        199 |   6.9480977   5.6724906    78586847    78586847
        200 |    6.904271   5.6210456    77200408    77200408
        201 |   6.8769965   5.6358765    77175558    77175558
------------+------------------------------------------------
      Total |   7.0831182   5.6074216  8761512793 -2147483648

. do "C:\Users\LAFUEN~1\AppData\Local\Temp\STD33ec_000000.tmp"

. capture log close
