(fitting base model)
--Break--
r(1);

end of do-file

--Break--
r(1);

. tab mother

     mother |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,400,365       90.30       90.30
          1 |  1,116,769        9.70      100.00
------------+-----------------------------------
      Total | 11,517,134      100.00

. tab mother_5 mother

           |        mother
  mother_5 |         0          1 |     Total
-----------+----------------------+----------
         0 |10,397,373    369,081 |10,766,454 
         1 |     2,992    747,688 |   750,680 
-----------+----------------------+----------
     Total |10,400,365  1,116,769 |11,517,134 

. tab mother_10 mother

           |        mother
 mother_10 |         0          1 |     Total
-----------+----------------------+----------
         0 |10,397,162      3,199 |10,400,361 
         1 |     3,203  1,113,570 | 1,116,773 
-----------+----------------------+----------
     Total |10,400,365  1,116,769 |11,517,134 

. tab mother_15 mother

           |        mother
 mother_15 |         0          1 |     Total
-----------+----------------------+----------
         0 |10,397,193      3,177 |10,400,370 
         1 |     3,172  1,113,592 | 1,116,764 
-----------+----------------------+----------
     Total |10,400,365  1,116,769 |11,517,134 

. tab mother, sum(age)

            |   Summary of Age in 5 year groups
     mother |        Mean   Std. dev.       Freq.
------------+------------------------------------
          0 |   39.778545   21.766331  10,400,365
          1 |   37.582562   6.7404187   1,116,769
------------+------------------------------------
      Total |   39.565609   20.800506  11,517,134

. tab mother_15 age

           |                                             Age in 5 year groups
 mother_15 |         0          5         10         16         20         25         30         35         40         45 |     Total
-----------+--------------------------------------------------------------------------------------------------------------+----------
         0 |   498,644    574,047    718,444    493,691    595,995    528,107    484,389    504,508    573,043    692,518 |10,400,370 
         1 |         0          0          0          0     18,766     62,740    166,389    284,137    311,955    205,159 | 1,116,764 
-----------+--------------------------------------------------------------------------------------------------------------+----------
     Total |   498,644    574,047    718,444    493,691    614,761    590,847    650,778    788,645    884,998    897,677 |11,517,134 


           |            Age in 5 year groups
 mother_15 |        50         55         60         65 |     Total
-----------+--------------------------------------------+----------
         0 |   794,917    799,261    725,499  2,417,307 |10,400,370 
         1 |    67,618          0          0          0 | 1,116,764 
-----------+--------------------------------------------+----------
     Total |   862,535    799,261    725,499  2,417,307 |11,517,134 

. tab mother_10 age

           |                                             Age in 5 year groups
 mother_10 |         0          5         10         16         20         25         30         35         40         45 |     Total
-----------+--------------------------------------------------------------------------------------------------------------+----------
         0 |   498,644    574,047    718,444    493,691    596,022    528,104    484,354    504,562    573,046    692,481 |10,400,361 
         1 |         0          0          0          0     18,739     62,743    166,424    284,083    311,952    205,196 | 1,116,773 
-----------+--------------------------------------------------------------------------------------------------------------+----------
     Total |   498,644    574,047    718,444    493,691    614,761    590,847    650,778    788,645    884,998    897,677 |11,517,134 


           |            Age in 5 year groups
 mother_10 |        50         55         60         65 |     Total
-----------+--------------------------------------------+----------
         0 |   794,899    799,261    725,499  2,417,307 |10,400,361 
         1 |    67,636          0          0          0 | 1,116,773 
-----------+--------------------------------------------+----------
     Total |   862,535    799,261    725,499  2,417,307 |11,517,134 

. drop age2550 age3045 age3035

. do "C:\Users\LAFUEN~1\AppData\Local\Temp\STD406c_000000.tmp"

. log using "./descriptive_stats/mother_child_ages.log", replace nomsg
log file already open
r(604);

end of do-file

r(604);

. log close
